# 4.5 Consistency checks

# Contents
# 1. Find missing values
# 2. Find duplicates
# 3. Remove duplicates
# 4. Repeat 1-3 on the Orders df
# 5. Create new customer flag

In [2]:
#import libraries
import pandas as pd
import numpy as np
import os

In [4]:
path = r'/Users/alison/Documents/Data Analysis - Tasks/Instacart  Basket Analysis'
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [12]:
path = r'/Users/alison/Documents/Data Analysis - Tasks/Instacart  Basket Analysis'
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = 0)

In [14]:
# check shape of ords df
df_ords.shape

(3421083, 6)

In [16]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [18]:
# check shape
df_prods.shape

(49693, 5)

# 1. Find missing values

In [15]:
#find missing values in prods df
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [17]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [19]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [24]:
# missing values cannot be imputed and total 16. Remove missing values.
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [26]:
# check missing values were removed. Should be 16 less rows.
df_prods_clean.shape

(49677, 5)

# 2. Find duplicates

In [28]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [30]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

# 3. Remove duplicates

In [36]:
# There are five duplicates which can be removed. Remove duplicates.
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [38]:
# check duplicates removed. Should be five less rows.
df_prods_clean_no_dups.shape

(49672, 5)

In [40]:
# export cleaned prods df
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# 4. Repeat 1-3 on the Orders df

In [33]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [35]:
#notes about the df_ords data above: days of the week min 0, max 6 as expected; hour of day min 00:00, max 23:23); days since last order min 0, max 303 days); nothing seems out of order.
# check for mixed  data types
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [37]:
#no mixed data in df_ords
#5. Run a check for missing values in your df_ords dataframe.
df_ords.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [14]:
df_nan2 = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [16]:
df_nan2

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

# 5. Create new customer flag

In [42]:
# These missing values might be new customer accounts without any existing orders since 0 days would record two orders on the same day. 
# There are 206209 rows in the days since last order column with missing values. Check also that the order number is 1.
# Need to create a new variable that acts like a flag based on the missing value. 
# First create the 'New_customer' column
def New_customer(row):
    if pd.isna(row['days_since_prior_order']) and (row['order_number'] == 1):
        return 'Yes'
    else:
        return 'No'

In [44]:
df_ords['New_customer_flag'] = df_ords.apply(New_customer, axis=1)

In [45]:
print (df_ords)

         order_id  user_id  order_number  orders_day_of_week  \
0         2539329        1             1                   2
1         2398795        1             2                   3
2          473747        1             3                   3
3         2254736        1             4                   4
4          431534        1             5                   4
...           ...      ...           ...                 ...
3421078   2266710   206209            10                   5
3421079   1854736   206209            11                   4
3421080    626363   206209            12                   1
3421081   2977660   206209            13                   1
3421082    272231   206209            14                   6

         order_hour_of_day  days_since_prior_order New_customer_flag
0                        8                     NaN               Yes
1                        7                    15.0                No
2                       12                    21.0                No
3                        7                    29.0                No
4                       15                    28.0                No
...                    ...                     ...               ...
3421078                 18                    29.0                No
3421079                 10                    30.0                No
3421080                 12                    18.0                No
3421081                 12                     7.0                No
3421082                 14                    30.0                No

[3421083 rows x 7 columns]

In [52]:
#check of change made. Yes should be 206,209.
df_ords['New_customer_flag'].value_counts()

New_customer_flag
No     3214874
Yes     206209
Name: count, dtype: int64

In [54]:
# check for duplicates
df_ords_clean = df_ords[df_ords['user_id'].isnull() == False]

In [56]:
df_dups2 = df_ords_clean[df_ords_clean.duplicated()]

In [58]:
df_dups2

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, New_customer_flag]
Index: []

In [62]:
# no duplicates found
# confirm data dimensions of new ords df
df_ords_clean.shape

(3421083, 7)

In [64]:
# export clean ords df
df_ords_clean.to_csv(os.path.join(path, '02 Data','Prepared Data', 'ords_checked.csv'))